{"id":"9e3d01d0-e9c9-11ed-a25e-c53fb4790810","updated_at":"2023-05-03T16:26:08.394Z","updated_by":"elastic","created_at":"2023-05-03T15:46:07.116Z","created_by":"elastic","name":"Execution Into Container","tags":[],"interval":"3m","enabled":true,"description":"Manual exec from within container","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://172.19.0.2:31710/app/security"},"author":[],"false_positives":[],"from":"now-240s","rule_id":"6285aa5f-b3c8-4100-a8c9-6271e55f0719","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":8,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"message : \"kubectl exec\"","filters":[{"$state":{"store":"appState"},"meta":{"field":"kubernetes.daemonset.name","negate":false,"alias":null,"disabled":false,"params":{"query":"tetragon"},"type":"phrase","key":"kubernetes.daemonset.name"},"query":{"match_phrase":{"kubernetes.daemonset.name":"tetragon"}}},{"$state":{"store":"appState"},"meta":{"field":"message","negate":false,"alias":null,"disabled":false,"params":{"query":"\"process_exec\""},"type":"phrase","key":"message"},"query":{"match_phrase":{"message":"\"process_exec\""}}}],"throttle":"rule","actions":[{"group":"default","id":"719684e0-e987-11ed-a25e-c53fb4790810","params":{"body":"\"{{context.alerts}}\""},"action_type_id":".webhook"}]}
{"id":"f6041c40-e9cf-11ed-a25e-c53fb4790810","updated_at":"2023-05-03T17:17:23.317Z","updated_by":"elastic","created_at":"2023-05-03T16:31:31.378Z","created_by":"elastic","name":"Credential Access Kubernetes ServiceAccount","tags":[],"interval":"3m","enabled":true,"description":"Access container service account","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://172.19.0.2:31710/app/security"},"author":[],"false_positives":[],"from":"now-240s","rule_id":"79fe15f0-0ebd-44d9-b08f-966b8fdc19bb","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"message : \"run/secrets/kubernetes.io/serviceaccount/token\"","filters":[{"$state":{"store":"appState"},"meta":{"field":"kubernetes.daemonset.name","negate":false,"alias":null,"disabled":false,"params":{"query":"tetragon"},"type":"phrase","key":"kubernetes.daemonset.name"},"query":{"match_phrase":{"kubernetes.daemonset.name":"tetragon"}}},{"$state":{"store":"appState"},"meta":{"field":"message","negate":false,"alias":null,"disabled":false,"params":{"query":"\"process_exec\""},"type":"phrase","key":"message"},"query":{"match_phrase":{"message":"\"process_exec\""}}}],"throttle":"rule","actions":[{"group":"default","id":"719684e0-e987-11ed-a25e-c53fb4790810","params":{"body":"\"{{context.alerts}}\""},"action_type_id":".webhook"}]}
{"id":"4791cff0-e9c9-11ed-a25e-c53fb4790810","updated_at":"2023-05-03T15:45:10.891Z","updated_by":"elastic","created_at":"2023-05-03T15:43:41.712Z","created_by":"elastic","name":"Initial Access [etc/passwd]","tags":[],"interval":"3m","enabled":true,"description":"Shell Command Injection","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://172.19.0.2:31710/app/security"},"author":[],"false_positives":[],"from":"now-240s","rule_id":"b353349f-acd4-488e-8352-1f0d7412150a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"message : \"etc/passwd\"","filters":[{"$state":{"store":"appState"},"meta":{"field":"kubernetes.daemonset.name","negate":false,"alias":null,"disabled":false,"params":{"query":"tetragon"},"type":"phrase","key":"kubernetes.daemonset.name"},"query":{"match_phrase":{"kubernetes.daemonset.name":"tetragon"}}},{"$state":{"store":"appState"},"meta":{"field":"message","negate":false,"alias":null,"disabled":false,"params":{"query":"\"process_exec\""},"type":"phrase","key":"message"},"query":{"match_phrase":{"message":"\"process_exec\""}}}],"throttle":"rule","actions":[{"group":"default","id":"719684e0-e987-11ed-a25e-c53fb4790810","params":{"body":"\"{{context.alerts}}\""},"action_type_id":".webhook"}]}
{"id":"52f8e9e0-e9cf-11ed-a25e-c53fb4790810","updated_at":"2023-05-03T16:27:47.975Z","updated_by":"elastic","created_at":"2023-05-03T16:26:57.821Z","created_by":"elastic","name":"Execution Pod Creation","tags":[],"interval":"3m","enabled":true,"description":"Initial construction of a new pod","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://172.19.0.2:31710/app/security"},"author":[],"false_positives":[],"from":"now-240s","rule_id":"fa2642cf-d3d0-45c5-804f-80b179193c57","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":9,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"message : (\"kubectl run\" or \"kubectl create\" or \"kubectl apply\")","filters":[{"$state":{"store":"appState"},"meta":{"field":"kubernetes.daemonset.name","negate":false,"alias":null,"disabled":false,"params":{"query":"tetragon"},"type":"phrase","key":"kubernetes.daemonset.name"},"query":{"match_phrase":{"kubernetes.daemonset.name":"tetragon"}}},{"$state":{"store":"appState"},"meta":{"field":"message","negate":false,"alias":null,"disabled":false,"params":{"query":"\"process_exec\""},"type":"phrase","key":"message"},"query":{"match_phrase":{"message":"\"process_exec\""}}}],"throttle":"rule","actions":[{"group":"default","id":"719684e0-e987-11ed-a25e-c53fb4790810","params":{"body":"\"{{context.alerts}}\""},"action_type_id":".webhook"}]}
{"id":"4ec25a30-e9d1-11ed-a25e-c53fb4790810","updated_at":"2023-05-03T16:50:03.291Z","updated_by":"elastic","created_at":"2023-05-03T16:41:09.759Z","created_by":"elastic","name":"Bash History","tags":[],"interval":"3m","enabled":true,"description":" Searching the bash command history for insecurely stored credentials","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://172.19.0.2:31710/app/security"},"author":[],"false_positives":[],"from":"now-240s","rule_id":"1727aada-5a7b-4879-87be-c97e0654215c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":9,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"message : (\"~/.bash_history\" or \"history\")","filters":[{"$state":{"store":"appState"},"meta":{"field":"kubernetes.daemonset.name","negate":false,"alias":null,"disabled":false,"params":{"query":"tetragon"},"type":"phrase","key":"kubernetes.daemonset.name"},"query":{"match_phrase":{"kubernetes.daemonset.name":"tetragon"}}},{"$state":{"store":"appState"},"meta":{"field":"message","negate":false,"alias":null,"disabled":false,"params":{"query":"\"process_exec\""},"type":"phrase","key":"message"},"query":{"match_phrase":{"message":"\"process_exec\""}}}],"throttle":"rule","actions":[{"group":"default","id":"719684e0-e987-11ed-a25e-c53fb4790810","params":{"body":"\"{{context.alerts}}\""},"action_type_id":".webhook"}]}
{"id":"73e467b0-e9e3-11ed-a25e-c53fb4790810","updated_at":"2023-05-03T18:52:02.076Z","updated_by":"elastic","created_at":"2023-05-03T18:51:02.998Z","created_by":"elastic","name":"Dump All","tags":[],"interval":"3m","enabled":true,"description":"Reconnaissance","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://172.19.0.2:31710/app/security"},"author":[],"false_positives":[],"from":"now-240s","rule_id":"b3d0d8ef-4520-4d4c-8d18-71e84700c631","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":12,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"message : \"kubectl api-resources\"","filters":[{"$state":{"store":"appState"},"meta":{"field":"kubernetes.daemonset.name","negate":false,"alias":null,"disabled":false,"params":{"query":"tetragon"},"type":"phrase","key":"kubernetes.daemonset.name"},"query":{"match_phrase":{"kubernetes.daemonset.name":"tetragon"}}},{"$state":{"store":"appState"},"meta":{"field":"message","negate":false,"alias":null,"disabled":false,"params":{"query":"\"process_exec\""},"type":"phrase","key":"message"},"query":{"match_phrase":{"message":"\"process_exec\""}}}],"throttle":"rule","actions":[{"group":"default","id":"719684e0-e987-11ed-a25e-c53fb4790810","params":{"body":"\"{{context.alerts}}\""},"action_type_id":".webhook"}]}
{"id":"e3d92620-e9cd-11ed-a25e-c53fb4790810","updated_at":"2023-05-03T16:21:54.449Z","updated_by":"elastic","created_at":"2023-05-03T16:16:41.907Z","created_by":"elastic","name":"Execution Pod Modification","tags":[],"interval":"3m","enabled":true,"description":"Changes made to a pod, including its settings and/or control data","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://172.19.0.2:31710/app/security"},"author":[],"false_positives":[],"from":"now-240s","rule_id":"39fc2b4d-c8cf-498b-b0a8-d1feaf174b8e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":8,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"message : (\"kubectl set\" or \"kubectl patch\" or \"kubectl edit\")","filters":[{"$state":{"store":"appState"},"meta":{"field":"kubernetes.daemonset.name","negate":false,"alias":null,"disabled":false,"params":{"query":"tetragon"},"type":"phrase","key":"kubernetes.daemonset.name"},"query":{"match_phrase":{"kubernetes.daemonset.name":"tetragon"}}},{"$state":{"store":"appState"},"meta":{"field":"message","negate":false,"alias":null,"disabled":false,"params":{"query":"\"process_exec\""},"type":"phrase","key":"message"},"query":{"match_phrase":{"message":"\"process_exec\""}}}],"throttle":"rule","actions":[{"group":"default","id":"719684e0-e987-11ed-a25e-c53fb4790810","params":{"body":"\"{{context.alerts}}\""},"action_type_id":".webhook"}]}
{"id":"fbeef200-e9d5-11ed-a25e-c53fb4790810","updated_at":"2023-05-03T17:17:44.385Z","updated_by":"elastic","created_at":"2023-05-03T17:14:38.278Z","created_by":"elastic","name":"Credential Access Proc Filesystem","tags":[],"interval":"3m","enabled":true,"description":"Proc Filesystem Adversaries may gather credentials from the proc filesystem or /proc","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://172.19.0.2:31710/app/security"},"author":[],"false_positives":[],"from":"now-240s","rule_id":"a14d978d-11bd-4e39-a2e3-e8e10f71704a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"message : \"/proc\"","filters":[{"meta":{"disabled":false,"negate":false,"alias":null,"key":"kubernetes.daemonset.name","field":"kubernetes.daemonset.name","params":{"query":"tetragon"},"type":"phrase"},"query":{"match_phrase":{"kubernetes.daemonset.name":"tetragon"}},"$state":{"store":"appState"}},{"meta":{"disabled":false,"negate":false,"alias":null,"key":"message","field":"message","params":{"query":"\"process_exec\""},"type":"phrase"},"query":{"match_phrase":{"message":"\"process_exec\""}},"$state":{"store":"appState"}}],"throttle":"rule","actions":[{"group":"default","id":"719684e0-e987-11ed-a25e-c53fb4790810","params":{"body":"\"{{context.alerts}}\""},"action_type_id":".webhook"}]}
{"id":"3a8441e0-e9d7-11ed-a25e-c53fb4790810","updated_at":"2023-05-03T18:22:23.826Z","updated_by":"elastic","created_at":"2023-05-03T17:23:32.795Z","created_by":"elastic","name":"Credential Access SSH","tags":[],"interval":"3m","enabled":true,"description":"Read SSH information","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://172.19.0.2:31710/app/security"},"author":[],"false_positives":[],"from":"now-240s","rule_id":"1a2c6d76-bb7b-49d0-889e-86493ef87b0a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":10,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"message : (\"~/.ssh\")","filters":[{"$state":{"store":"appState"},"meta":{"field":"kubernetes.daemonset.name","negate":false,"alias":null,"disabled":false,"params":{"query":"tetragon"},"type":"phrase","key":"kubernetes.daemonset.name"},"query":{"match_phrase":{"kubernetes.daemonset.name":"tetragon"}}},{"$state":{"store":"appState"},"meta":{"field":"message","negate":false,"alias":null,"disabled":false,"params":{"query":"\"process_exec\""},"type":"phrase","key":"message"},"query":{"match_phrase":{"message":"\"process_exec\""}}}],"throttle":"rule","actions":[{"group":"default","id":"719684e0-e987-11ed-a25e-c53fb4790810","params":{"body":"\"{{context.alerts}}\""},"action_type_id":".webhook"}]}
{"id":"de3caa90-e9df-11ed-a25e-c53fb4790810","updated_at":"2023-05-03T18:26:41.172Z","updated_by":"elastic","created_at":"2023-05-03T18:25:23.466Z","created_by":"elastic","name":"Setup Backdoor","tags":[],"interval":"3m","enabled":true,"description":"Persistence","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://172.19.0.2:31710/app/security"},"author":[],"false_positives":[],"from":"now-240s","rule_id":"c9020aec-96e2-47f1-80b5-4e4d17eda61c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":11,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"message : \"openssh-server\"","filters":[{"$state":{"store":"appState"},"meta":{"field":"kubernetes.daemonset.name","negate":false,"alias":null,"disabled":false,"params":{"query":"tetragon"},"type":"phrase","key":"kubernetes.daemonset.name"},"query":{"match_phrase":{"kubernetes.daemonset.name":"tetragon"}}},{"$state":{"store":"appState"},"meta":{"field":"message","negate":false,"alias":null,"disabled":false,"params":{"query":"\"process_exec\""},"type":"phrase","key":"message"},"query":{"match_phrase":{"message":"\"process_exec\""}}}],"throttle":"rule","actions":[{"group":"default","id":"719684e0-e987-11ed-a25e-c53fb4790810","params":{"body":"\"{{context.alerts}}\""},"action_type_id":".webhook"}]}
{"id":"64222ea0-e9a9-11ed-a25e-c53fb4790810","updated_at":"2023-05-03T12:08:54.473Z","updated_by":"elastic","created_at":"2023-05-03T11:55:26.728Z","created_by":"elastic","name":"Initial Access [etc/shadow]","tags":[],"interval":"3m","enabled":true,"description":"Shell Command Injection","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://172.19.0.2:31710/app/security"},"author":[],"false_positives":[],"from":"now-240s","rule_id":"820ca1d5-6b31-4ff7-a407-efc08d090495","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"message : \"etc/shadow\"","filters":[{"meta":{"disabled":false,"negate":false,"alias":null,"key":"kubernetes.daemonset.name","field":"kubernetes.daemonset.name","params":{"query":"tetragon"},"type":"phrase"},"query":{"match_phrase":{"kubernetes.daemonset.name":"tetragon"}},"$state":{"store":"appState"}},{"meta":{"disabled":false,"negate":false,"alias":null,"key":"message","field":"message","params":{"query":"\"process_exec\""},"type":"phrase"},"query":{"match_phrase":{"message":"\"process_exec\""}},"$state":{"store":"appState"}}],"throttle":"rule","actions":[{"group":"default","id":"719684e0-e987-11ed-a25e-c53fb4790810","params":{"body":"\"{{context.alerts}}\""},"action_type_id":".webhook"}]}
{"id":"719684e0-e987-11ed-a25e-c53fb4790810","type":"action","updated_at":"2023-05-03T11:45:40.710Z","created_at":"2023-05-03T11:45:40.710Z","version":"WzE0MjYsMV0=","attributes":{"actionTypeId":".webhook","name":"Kubernetes Security","isMissingSecrets":false,"config":{"method":"post","url":"http://10.96.130.236:50000/api/v1/webhook","hasAuth":false,"headers":null},"secrets":{}},"references":[],"migrationVersion":{"action":"8.3.0"},"coreMigrationVersion":"8.7.0"}
{"exported_count":12,"exported_rules_count":11,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":1,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}